Tekla.Structures.Model.Internal.BimModelDataProduct.Tools.BytesToUploadProgressAdapter
Adapter to convert byte-level progress reporting to UploadProgress with percentage calculation.

Tekla.Structures.Model.Internal.BimModelDataProduct.Tools.BytesToUploadProgressAdapter.#ctor(System.Nullable{System.Int64},System.IProgress{Tekla.Structures.Model.Internal.BimModelDataProduct.Types.UploadProgress})
Initializes a new instance of the Tekla.Structures.Model.Internal.BimModelDataProduct.Tools.BytesToUploadProgressAdapter class.
totalBytes: The total number of bytes to upload, 0 if unknown.
target: The target progress reporter that receives "UploadProgress" updates.
Throws System.ArgumentNullException: Thrown if target is null.

Tekla.Structures.Model.Internal.BimModelDataProduct.Tools.BytesToUploadProgressAdapter.Report(System.Int64)
Reports progress update with the number of bytes uploaded.
bytesUploaded: The number of bytes uploaded.